// Таблица умножения
// for (i = 2; i < 11; i++){
//     for (a = 1; a < 11; a++){
//         console.log(`${i} * ${a} = ${i*a}`)
//     } 
//     console.log(' ')
// }


//Проценты в банке
// let a = 10000;
//     b = 0.1;
// for (c = 1; c < 6; c++){
//     a = a + (a*b)
//     console.log(a)
// }
// console.log(`Через 5 лет на вашем счету в банке будет ${a} $`)

//Вычеслить сумму ряда
// let n = +prompt('Введите число n');
//     s = 0;
// for (a = 1; a <= n; a++){
//     s+=a;
// }
// console.log(s)

//Cумма ряда дробныч чисел
// let n = +prompt('Введите число n');
//     s = 0;
// for (i = 1; 1 <= n; i++){
//     s = s + (1/(2**i));
// }
// console.log(s)